/* eslint-disable no-unused-vars */

/*
Работа с переменными
важность: 2
1. Объявите две переменные: admin и name.
2. Запишите строку "Джон" в переменную name.
3. Скопируйте значение из переменной name в admin.
4. Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).
*/

let admin;
let name;

name = "Джон";
admin = name;

console.log(admin);

/*
Придумайте правильные имена
важность: 3
Создайте переменную для названия нашей планеты. Как бы вы её назвали?
Создайте переменную для хранения имени текущего посетителя сайта. 
Как бы вы назвали такую переменную?
*/

let ourPlanetName = "Земля";
let currentUserName = "Джон";